Tekla.Structures.ModelInternal.IPropertySetDialogFeature
Interface to control property set dialog feature.

Tekla.Structures.ModelInternal.IPropertySetDialogFeature.OpenDialog(System.String)
Open or focus Property Set Dialog.
propertySetConfigurationName: The name of the property set to open. Empty if new one should be created.

Tekla.Structures.ModelInternal.IPropertySetDialogFeature.DialogClosed
Raised when the dialog window is closed.